/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   tmp.h                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: myukang <myukang@student.42.kr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/06/08 18:11:20 by myukang           #+#    #+#             */
/*   Updated: 2022/06/09 16:33:23 by myukang          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


//출력 로그를 찍어보기위한 함수들 헤더
#include "tokenizer.h"
# include <stdio.h>
void	print_token_lst(t_data *data);
void	print_toks(t_token *token_buf);
